<a href="https://colab.research.google.com/github/salimunlu47/data-science-libraries/blob/main/Jose_Portilla_Pandas_Part2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Useful Methods

In [2]:
import numpy as np
import pandas as pd

In [3]:
url = "https://raw.githubusercontent.com/salimunlu47/data-science-libraries/main/datasets/tips.csv"
df = pd.read_csv(url)
df.head()

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

In [4]:
def simple(num):
  return num*2

In [5]:
lambda num: num*2

In [6]:
df["total_bill"].apply(simple)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [7]:
df["total_bill"].apply(lambda num: num*2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [8]:
def quality(total_bill,tip):
  if tip/total_bill > 0.25:
    return "Generous"
  else:
    return "Other"

In [9]:
quality(16.99,1.01)

'Other'

In [10]:
df["Quality"]=df[["total_bill", "tip"]].apply(lambda df: quality(df["total_bill"],df["tip"]),axis=1)

In [11]:
df["Quality"] = np.vectorize(quality)(df["total_bill"],df["tip"])

In [12]:
df.head()

   total_bill   tip     sex  ...         CC Number Payment ID Quality
0       16.99  1.01  Female  ...  3560325168603410    Sun2959   Other
1       10.34  1.66    Male  ...  4478071379779230    Sun4608   Other
2       21.01  3.50    Male  ...  6011812112971322    Sun4458   Other
3       23.68  3.31    Male  ...  4676137647685994    Sun5260   Other
4       24.59  3.61  Female  ...  4832732618637221    Sun2251   Other

[5 rows x 12 columns]

In [13]:
import timeit

In [14]:
# code snippet to be executed only once 
setup = '''
import numpy as np
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/salimunlu47/data-science-libraries/main/datasets/tips.csv")
def quality(total_bill,tip):
    if tip/total_bill  > 0.25:
        return "Generous"
    else:
        return "Other"
'''

In [15]:
# code snippet whose execution time is to be measured 
stmt_one = ''' 
df['Tip Quality'] = df[['total_bill','tip']].apply(lambda df: quality(df['total_bill'],df['tip']),axis=1)
'''

stmt_two = '''
df['Tip Quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])
'''

In [16]:
timeit.timeit(setup=setup, stmt=stmt_one, number=1000)

4.863294903999986

In [17]:
timeit.timeit(setup=setup, stmt=stmt_two, number=1000)

0.4051497760000302

In [18]:
url = "https://raw.githubusercontent.com/salimunlu47/data-science-libraries/main/datasets/tips.csv"
df = pd.read_csv(url)

In [19]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [20]:
df.sort_values("tip", ascending=False)

     total_bill    tip     sex  ...          Payer Name         CC Number Payment ID
170       50.81  10.00    Male  ...       Gregory Clark  5473850968388236    Sat1954
212       48.33   9.00    Male  ...     Alex Williamson      676218815212    Sat4590
23        39.42   7.58    Male  ...      Lance Peterson  3542584061609808     Sat239
59        48.27   6.73    Male  ...         Brian Ortiz  6596453823950595    Sat8139
141       34.30   6.70    Male  ...      Steven Carlson  3526515703718508   Thur1025
..          ...    ...     ...  ...                 ...               ...        ...
0         16.99   1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
236       12.60   1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
111        7.25   1.00  Female  ...         Terri Jones  3559221007826887    Sat4801
67         3.07   1.00  Female  ...       Tiffany Brock  4359488526995267    Sat3455
92         5.75   1.00  Female  ...        Leah Ramirez  3508911676966392    Fri3780

[244 rows x 11 columns]

In [21]:
df.sort_values(["tip", "size"])

     total_bill    tip     sex  ...          Payer Name         CC Number Payment ID
67         3.07   1.00  Female  ...       Tiffany Brock  4359488526995267    Sat3455
111        7.25   1.00  Female  ...         Terri Jones  3559221007826887    Sat4801
92         5.75   1.00  Female  ...        Leah Ramirez  3508911676966392    Fri3780
236       12.60   1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
0         16.99   1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
..          ...    ...     ...  ...                 ...               ...        ...
141       34.30   6.70    Male  ...      Steven Carlson  3526515703718508   Thur1025
59        48.27   6.73    Male  ...         Brian Ortiz  6596453823950595    Sat8139
23        39.42   7.58    Male  ...      Lance Peterson  3542584061609808     Sat239
212       48.33   9.00    Male  ...     Alex Williamson      676218815212    Sat4590
170       50.81  10.00    Male  ...       Gregory Clark  5473850968388236    Sat1954

[244 rows x 11 columns]

In [22]:
df["total_bill"].max()

50.81

In [23]:
df["total_bill"].idxmax()

170

In [24]:
df.iloc[170]

total_bill                     50.81
tip                               10
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Name: 170, dtype: object

In [25]:
df.iloc[df["total_bill"].idxmin()]

total_bill                      3.07
tip                                1
sex                           Female
smoker                           Yes
day                              Sat
time                          Dinner
size                               1
price_per_person                3.07
Payer Name             Tiffany Brock
CC Number           4359488526995267
Payment ID                   Sat3455
Name: 67, dtype: object

In [26]:
df.corr()

                  total_bill       tip      size  price_per_person  CC Number
total_bill          1.000000  0.675734  0.598315          0.647554   0.104576
tip                 0.675734  1.000000  0.489299          0.347405   0.110857
size                0.598315  0.489299  1.000000         -0.175359  -0.030239
price_per_person    0.647554  0.347405 -0.175359          1.000000   0.135240
CC Number           0.104576  0.110857 -0.030239          0.135240   1.000000

In [27]:
df.head()

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

In [28]:
df["sex"].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [31]:
df["day"].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [32]:
df["day"].nunique()

4

In [34]:
df["sex"].replace(["Female", "Male"], ["F","M"])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [35]:
mymap = {"Female":"F", "Male":"M"}

In [36]:
df["sex"].map(mymap)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [37]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [38]:
simple_df = pd.DataFrame([1,2,2],["a","b","c"])

In [39]:
simple_df

   0
a  1
b  2
c  2

In [40]:
simple_df.duplicated()

a    False
b    False
c     True
dtype: bool

In [41]:
simple_df.drop_duplicates()

   0
a  1
b  2

In [44]:
df[df["total_bill"].between(10,20,inclusive=True)].head()

    total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0        16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1        10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
8        15.04  1.96    Male  ...     Joseph Mcdonald  3522866365840377    Sun6820
9        14.78  3.23    Male  ...       Jerome Abbott  3532124519049786    Sun3775
10       10.27  1.71    Male  ...       William Riley      566287581219    Sun2546

[5 rows x 11 columns]

In [45]:
df.nlargest(5,"tip")

     total_bill    tip   sex  ...       Payer Name         CC Number Payment ID
170       50.81  10.00  Male  ...    Gregory Clark  5473850968388236    Sat1954
212       48.33   9.00  Male  ...  Alex Williamson      676218815212    Sat4590
23        39.42   7.58  Male  ...   Lance Peterson  3542584061609808     Sat239
59        48.27   6.73  Male  ...      Brian Ortiz  6596453823950595    Sat8139
141       34.30   6.70  Male  ...   Steven Carlson  3526515703718508   Thur1025

[5 rows x 11 columns]

In [46]:
df.nsmallest(2,"tip")

    total_bill  tip     sex  ...     Payer Name         CC Number Payment ID
67        3.07  1.0  Female  ...  Tiffany Brock  4359488526995267    Sat3455
92        5.75  1.0  Female  ...   Leah Ramirez  3508911676966392    Fri3780

[2 rows x 11 columns]

In [47]:
df.sort_values("tip", ascending=True).iloc[0:2]

     total_bill  tip     sex  ...     Payer Name         CC Number Payment ID
67         3.07  1.0  Female  ...  Tiffany Brock  4359488526995267    Sat3455
236       12.60  1.0    Male  ...  Matthew Myers  3543676378973965    Sat5032

[2 rows x 11 columns]

In [48]:
df.sample(5)

     total_bill   tip     sex  ...        Payer Name         CC Number Payment ID
179       34.63  3.55    Male  ...      Brian Bailey   346656312114848    Sun9851
193       15.48  2.02    Male  ...  Raymond Sullivan   180068856139315    Thur606
232       11.61  3.39    Male  ...      James Taylor  6011482917327995    Sat2124
188       18.15  3.50  Female  ...    Glenda Wiggins      578329325307     Sun430
87        18.28  4.00    Male  ...   Donald Williams  5363745772301404   Thur3636

[5 rows x 11 columns]

In [49]:
df.sample(frac=0.1)

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
155       29.85  5.14  Female  ...      Madison Wilson  4210875236164664    Sun9176
6          8.77  2.00    Male  ...  Kristopher Johnson  2223727524230344    Sun5985
30         9.55  1.45    Male  ...          Grant Hall    30196517521548    Sat4099
61        13.81  2.00    Male  ...      Ryan Hernandez     4766834726806    Sat3030
178        9.60  4.00  Female  ...        Melanie Gray     4211808859168    Sun4598
102       44.30  2.50  Female  ...       Heather Cohen   379771118886604    Sat6240
154       19.77  2.00    Male  ...         James Smith   213169731428229    Sun5814
116       29.93  5.07    Male  ...         Shawn Blake  4689079711213722      Sun22
151       13.13  2.00    Male  ...        Jason Arnold  3571825125296106    Sun2127
95        40.17  4.73    Male  ...       Aaron Bentley   180026611638690    Fri9628
53         9.94  1.56    Male  ...       Curtis Morgan  4628628020417301    Sun4561
182       45.35  3.50    Male  ...        Jose Parsons  4112207559459910    Sun2337
124       12.48  2.52  Female  ...         Jordan Diaz  4472778228206399    Thur208
163       13.81  2.00    Male  ...      Charles Newton  5552793481414044    Sun8594
137       14.15  2.00  Female  ...      Vanessa Morris   213189344156819   Thur3890
228       13.28  2.72    Male  ...         Glenn Jones      502061651712    Sat2937
191       19.81  4.19  Female  ...         Kristy Boyd  4317015327600068    Thur967
103       22.42  3.48  Female  ...    Kathleen Hawkins   348009865484721    Sat1015
25        17.81  2.34    Male  ...      Robert Perkins    30502930499388     Sat907
138       16.00  2.00    Male  ...       Jason Burgess  3561461821942363   Thur2710
180       34.65  3.68    Male  ...    James Hebert DDS      676168737648    Sun7544
85        34.83  5.17  Female  ...         Shawna Cook  6011787464177340   Thur7972
47        32.40  6.00    Male  ...        James Barnes  3552002592874186    Sun9677
32        15.06  3.00  Female  ...       Amanda Wilson   213186304291560    Sat1327

[24 rows x 11 columns]